class Ingredent {
  double quantity;
  String mancure;
  String name;

  Ingredent(
    this.quantity,
    this.mancure,
    this.name,
  );
}

class Racipe {
  String label;
  String imageUrl;
  int severnce;
  List<Ingredent> ingredent;

  Racipe(
    this.label,
    this.imageUrl,
    this.severnce,
    this.ingredent,
  );
  static List<Racipe> sample = [
    Racipe(
      'ট্রানজিস্টরের বৈশিষ্ট্যসমূহ',
      'assets/image1.jpg',
      21,
      [
        Ingredent(
          01,
          'ট্রানজিস্টর কী?',
          '''
      ট্রানজিস্টর একটি সেমিকন্ডাক্টর ডিভাইস যার সাথে তিনটি সংযোগ যন্ত্র রয়েছে। এই ডিভাইসটি প্রধানত বৈদ্যুতিন সংকেত অ্যাপ্লিকেশনগুলিতে স্যুইচিংয়ের পরিবর্ধনের জন্য ব্যবহৃত হয়।
''',
        ),
        Ingredent(02, 'একটি ট্রানজিস্টরের বৈশিষ্ট্য:', '''
-একটি ট্রানজিস্টার বর্তমান এবং ভোল্টেজের মধ্যে সম্পর্কের প্রতিনিধিত্ব করে।
    (০১)এটি সাধারণভাবে একটি দ্বি-বন্দর নেটওয়ার্ক
    (০২)প্রতিটি ট্রানজিস্টার মোডের বিভিন্ন ইনপুট বৈশিষ্ট্য, আউটপুট বৈশিষ্ট্য এবং বর্তমান স্থানান্তর বৈশিষ্ট্য রয়েছে।
    (০৩)একটি ট্রানজিস্টরে তিনটি খুঁটি থাকে এবং প্রতিটি খুঁটিই মূলত এন-টাইপ এবং পি-টাইপ সাবস্ট্রেটের তৈরি হয়।

“একটি ট্রানজিস্টার তিনটি টার্মিনাল নিয়ে গঠিত”

    ১)বিকিরণকারী(Emitter)
    ২)ভিত্তি(Base)
    ৩)সংগ্রাহক(Collector)

-ট্রানজিস্টর দুটি মূল বিভাগে বিভক্ত হয়েছে
    ১)বাইপোলার জংশন ট্রানজিস্টর (বিজেটি)
    ২)ফিল্ড এফেক্ট ট্রানজিস্টর (এফইটি)

-ট্রানজিস্টারে তিনটি মোডও রয়েছে
    ১)কমন ইমিটার বা সিই মোড
    ২)কমন বেস বা সিবি মোড
    ৩)কমন কালেক্টর বা সিসি মোড

-ট্রানজিস্টর দুই প্রকার:
   ১)পিএনপি ট্রানজিস্টরের (PNP Transistor)
   ২)এনপিএন ট্রানজিস্টরের (NPN Transistor)


"পিএনপি এবং এনপিএন ট্রানজিস্টর সম্পর্কে আরও জানতে প্রথমে আমাদের পি-টাইপ এবং এন-টাইপ সেমিকন্ডাক্টর সম্পর্কে জানতে হবে।"
'''),
        Ingredent(03, 'পি-টাইপ অর্ধপরিবাহী কী?', '''

একটি পি-টাইপ অর্ধপরিবাহী (লিঙ্ক) কিছু ধরণের (প্রধানত তুচ্ছ) অভ্যন্তরীণ বা খাঁটি অর্ধপরিবাহী সংযোজন করা হয় এমন এক ধরণের অর্ধপরিবাহী is এই ধরণেরগুলিতে, গর্তগুলি সংখ্যাগরিষ্ঠ এবং ইলেকট্রনিক্সগুলি সংখ্যালঘু ক্যারিয়ার। 
তুচ্ছ অপরিষ্কারগুলি বোরন (B), গ্যালিয়াম (Ga) ইত্যাদি হতে পারে।

'''),
        Ingredent(04, 'এন-টাইপ সেমিকন্ডাক্টর কী?', '''

একটি এন-টাইপ সেমিকন্ডাক্টর হ'ল এক ধরণের অর্ধপরিবাহী যখন কিছু অমেধ্য (মূলত পেন্টাভ্যালেন্ট) বহির্মুখী অর্ধপরিবাহীর কাছে ডোপ হয়। এতে, ইলেক্ট্রনগুলি সংখ্যাগরিষ্ঠ বা প্রাথমিক ক্যারিয়ার এবং গর্তগুলি সংখ্যালঘু বা গৌণ ক্যারিয়ার।
এর কয়েকটি উদাহরণ হ'ল ফসফরাস (P), আর্সেনিক (As)

'''),
        Ingredent(05, 'ব্যান্ড গ্যাপ কী?', '''
    
    ব্যান্ড গ্যাপ:
        "ব্যান্ড গ্যাপটি ভারসাম্য ব্যান্ডের শীর্ষ এবং একটি অন্তরক এবং অর্ধপরিবাহীর মধ্যে পরিবাহী ব্যান্ডের নীচের মধ্যবর্তী শক্তি পার্থক্য বোঝায়” "

    নিষিদ্ধ গ্যাপ:
        - শক্ত মধ্যে, শক্ত মধ্যে একটি ইলেকট্রন তুলনায় শক্তি পরিসীমা একটি শক্তি ব্যান্ড থাকতে পারে, এবং এটি নাও পারে এমন একটি শক্তির পরিসীমাকে নিষিদ্ধ ব্যবধান বলে।

    ভারসাম্য ব্যান্ড এবং কন্ডাকশন ব্যান্ড:
        শক্ত অবস্থায়, ভারসাম্য ব্যান্ড এবং পরিবাহী ব্যান্ডগুলি ফার্মি স্তরের সবচেয়ে কাছের ব্যান্ড (একটি থার্মোডাইনামিক পরিমাণ by দ্বারা চিহ্নিত) এবং সলিডগুলির বৈদ্যুতিক চালকতা নির্ধারণ করে।

    ট্রানজিস্টর তৈরি করতে আমাদের দুটি ধরণের অর্ধপরিবাহী প্রয়োজন, যা হল:
        ১)অন্তর্নিহিত অর্ধপরিবাহী
        ২)এক্সট্রিনসিক অর্ধপরিবাহী


     অন্তর্নিহিত অর্ধপরিবাহী:
        - উপাদান খাঁটি ফর্ম হয়
        - কম বৈদ্যুতিক পরিবাহিতা
        - পরিবাহী ব্যান্ডে নিখরচায় ইলেকট্রনের সংখ্যা = ভারসাম্য ব্যান্ডের গর্তের সংখ্যা
        - বৈদ্যুতিক পরিবাহিতা তাপমাত্রার দ্বারা প্রভাবিত হয়।


    এক্সট্রিনসিক অর্ধপরিবাহী:
      এক্সট্রিন্সিক সেমিকন্ডাক্টরগুলি আরও দুটি ধরণের মধ্যে বিভক্ত

      ১)এন-টাইপ
      ২)পি টাইপ

          - পি-টাইপ এবং এন-টাইপ ডোপান্ট সহ ডোপড অপরিষ্কার উপাদান
          - গর্ত এবং ইলেকট্রনের সংখ্যা সমান নয়
          - উচ্চ বৈদ্যুতিক পরিবাহিতা
          - এসবি, পি, এলএন, বি এর মতো অমেধ্যগুলি সিলিকন এবং জার্মেনিয়াম পরমাণুগুলির সাথে ডোপড হয়।
'''),
        Ingredent(05, 'প্রত্যক্ষ এবং অপ্রত্যক্ষ ব্যান্ডগ্যাপ', '''
    সেমিকন্ডাক্টর ইলেক্ট্রনিক্সে, একটি অর্ধপরিবাহীর ব্যান্ডগ্যাপকে নিম্নোক্ত আকারে শ্রেণিবদ্ধ করা যেতে পারে:

       ১)সরাসরি ব্যান্ডগ্যাপ
       ২)পরোক্ষ ব্যান্ডগ্যাপ।


    ব্যান্ড স্ট্রাকচারের উপর নির্ভরশীল, পদার্থগুলির একটি সরাসরি ব্যান্ডগ্যাপ বা অপ্রত্যক্ষ ব্যান্ডগ্যাপ থাকে।


      ১)সরাসরি ব্যান্ড-ফাঁকটি দেখা দেয় যখন পরিবাহী অঞ্চল থেকে নিম্ন-শক্তি স্তরের গতিবেগ এবং ভ্যালেন্স অঞ্চল থেকে উচ্চ-শক্তি স্তর একই হয়।
      ২)ইন-ডাইরেক্ট ব্যান্ড-ফাঁকটি তখন ঘটে যখন পরিবাহী অঞ্চল থেকে নিম্ন-শক্তি স্তরের এবং ভ্যালেন্স অঞ্চল থেকে উচ্চ-শক্তি স্তরের গতিবেগ একই রকম হয় না।
      ৩)যখন একটি ইলেকট্রনের পর্যাপ্ত শক্তি থাকে, তারা পরিবাহী ব্যান্ডে পৌঁছতে পারে। এই প্রক্রিয়াতে, ফোটনগুলি নির্গত হচ্ছে।  
      ৪)অপ্রত্যক্ষভাবে ব্যান্ডগ্যাপ উপাদানের জন্য, ফোটন এবং ফোনন উভয়ই ওপরের ভ্যালেন্স ব্যান্ড শীর্ষ থেকে নিম্ন পরিবাহী ব্যান্ডে স্থানান্তরিত করা হয়।



ভ্যালেন্স ব্যান্ডের সর্বাধিক শক্তি রাষ্ট্র এবং পরিবাহী ব্যান্ডের ন্যূনতম শক্তি রাষ্ট্রটি ব্রিলোইন অঞ্চল কে-ভেক্টর বা একটি নির্দিষ্ট স্ফটিক গতিবেগ দ্বারা পৃথক করা হয়। ইভেন্টে কে-ভেক্টরগুলি স্বতন্ত্র হলে পদার্থটির একটি "পরোক্ষ ফাঁক" থাকে। ব্যান্ডগ্যাপটি প্রত্যক্ষ হিসাবে পরিচিত যদি গর্ত এবং ইলেক্ট্রনগুলির স্ফটিক আন্দোলন চালনা এবং ভ্যালেন্স ব্যান্ডগুলির মধ্যে সমান হয়; একটি e- একটি ফোটন নির্গত করতে পারে ইলেক্ট্রনকে মধ্যবর্তী মধ্য দিয়ে যেতে হয় এবং স্ফটিক জালের মধ্যে গতিবেগ স্থানান্তর করতে হয় বলে একটি "অপ্রত্যক্ষ" ব্যবধানের মধ্যে একটি ফোটন নির্গত হতে পারে না।

    সেমিমেটাল উপকরণ কি?

      প্রত্যক্ষ ফাঁকযুক্ত কিছু পদার্থে, পার্থক্যের মানটি নেতিবাচক। এ জাতীয় পদার্থকে সেমিমেটাল বলা হয়।

'''),
        Ingredent(06, 'মস -- বার্সটাইন প্রভাব', '''

  মোস-বার্সটাইন ইফেক্ট বা বার্সটিন-মোস শিফটটি এমন একটি উজ্জ্বলতা যেখানে অর্ধপরিবাহীর ব্যান্ডগ্যাপ বাড়তে পারে।

      -এটি অবক্ষয়যুক্ত ইলেক্ট্রন বিতরণের জন্য বা কিছু সেমিকন্ডাক্টরের ক্ষেত্রে দেখা যায়।  
      -মোস-বার্সটাইন অনুসারে শিফটটি ব্যান্ড গ্যাপ হয়


উপস্থিত ব্যান্ড গ্যাপ = আসল ব্যান্ড গ্যাপ + মোস-বার্সটিন শিফট


স্পষ্টতই ডোপড সেমিকন্ডাক্টরের মধ্যে, ভেরেন্স এবং বাহন ব্যান্ডগুলির মধ্যে ফার্মি স্তরটি খুঁজে পাওয়া উচিত।

উদাহরণস্বরূপ, একটি এন-টাইপ অর্ধপরিবাহীতে, ডোপিং ঘনত্ব বাড়ার সাথে সাথে ইলেক্ট্রনগুলি পরিবাহী অঞ্চলে জনবসতিপূর্ণ যা ফার্মি স্তরকে উচ্চতর শক্তির লেবেলে বাধ্য করে।

ফর্মি স্তরটি পরিমিত পরিমাণে ডোপিংয়ের জন্য পরিবাহী ব্যান্ডে অবস্থিত। পাওলির বর্জন নীতি এই প্রাক দখলকৃত রাজ্যগুলির জন্য উত্তেজনাকে নিষিদ্ধ করে। সুতরাং ব্যান্ডগ্যাপে দৃশ্যত একটি বৃদ্ধি লক্ষ্য করা গেছে।
'''),
      ],
    ),
    Racipe(
      'ট্রানজিস্টর বায়াসিং এবং স্ট্যাবিলাইজেশন',
      'assets/image2.jpg',
      21,
      [
        Ingredent(01, 'ট্রানজিস্টর বায়াসিং কি?', '''
    ট্রানজিস্টর বায়াসিং

      ট্রানজিস্টর বায়সিং হল একটি ট্রানজিস্টর ডিসি অপারেটিং ভোল্টেজ বা বর্তমান অবস্থাকে সঠিক স্তরে সেট করার প্রক্রিয়া যাতে যেকোন এসি ইনপুট সিগন্যাল ট্রানজিস্টর দ্বারা সঠিকভাবে প্রসারিত করা যায়।

একটি ট্রানজিস্টরের স্থির অবস্থার ক্রিয়াকলাপ তার বেস কারেন্ট, সংগ্রাহক ভোল্টেজ এবং সংগ্রাহকের বর্তমান মানগুলির উপর অনেক বেশি নির্ভর করে এবং তাই, যদি ট্রানজিস্টরটিকে একটি রৈখিক পরিবর্ধক হিসাবে সঠিকভাবে কাজ করতে হয় তবে এটি অবশ্যই তার অপারেটিং পয়েন্টের চারপাশে সঠিকভাবে পক্ষপাতদুষ্ট হতে হবে।
সঠিক অপারেটিং পয়েন্ট স্থাপনের জন্য উপযুক্ত ইনপুট কারেন্ট এবং সংগ্রাহক ভোল্টেজ শর্ত সরবরাহ করার জন্য পক্ষপাত প্রতিরোধক এবং লোড প্রতিরোধক নির্বাচন করা প্রয়োজন। একটি বাইপোলার ট্রানজিস্টরের জন্য সঠিক বায়াসিং পয়েন্ট, হয় NPN বা PNP, সাধারণত এটির ডিসি লোড লাইন বরাবর "সম্পূর্ণ-অন" বা "সম্পূর্ণ-বন্ধ" হওয়ার ক্ষেত্রে অপারেশনের দুটি চরমের মধ্যে কোথাও থাকে। এই কেন্দ্রীয় অপারেটিং পয়েন্টটিকে বলা হয় "ক্যুয়েসেন্ট অপারেটিং পয়েন্ট", বা সংক্ষেপে Q-পয়েন্ট।
যখন একটি বাইপোলার ট্রানজিস্টর পক্ষপাতদুষ্ট হয় যাতে Q-পয়েন্টটি তার অপারেটিং সীমার মাঝখানে থাকে, যা কাট-অফ এবং স্যাচুরেশনের মধ্যে প্রায় অর্ধেক, এটি একটি ক্লাস-এ পরিবর্ধক হিসাবে কাজ করছে বলে বলা হয়। অপারেশনের এই মোডটি আউটপুট ভোল্টেজকে বিকৃতি ছাড়াই এমপ্লিফায়ার Q-পয়েন্টের চারপাশে বৃদ্ধি এবং হ্রাস করতে দেয় কারণ ইনপুট সিগন্যালটি একটি সম্পূর্ণ চক্রের মাধ্যমে সুইং করে। অন্য কথায়, ইনপুট চক্রের সম্পূর্ণ 360o এর জন্য আউটপুট পাওয়া যায়।      

তাহলে কিভাবে আমরা একটি ট্রানজিস্টরের এই Q-পয়েন্ট বায়াসিং সেট করব?\

        ট্রানজিস্টরের সঠিক বায়াসিং একটি প্রক্রিয়া ব্যবহার করে অর্জন করা হয় যা সাধারণত বেস বায়াস নামে পরিচিত।

    কিন্তু আমরা সম্ভাব্য বিভিন্ন ট্রানজিস্টর বায়াসিং ব্যবস্থার দিকে তাকানো শুরু করার আগে, প্রথমে বাম দিকে দেখানো হিসাবে এর ভোল্টেজ এবং স্রোত সহ একটি মৌলিক একক ট্রানজিস্টর সার্কিটের কথা মনে করিয়ে দেওয়া যাক।
"ডিসি বায়াস লেভেল"-এর কাজ হল ট্রানজিস্টর বেসে প্রয়োগ করা কোনো বাহ্যিক ইনপুট সিগন্যাল ছাড়াই তার কালেক্টর কারেন্ট ( IC ) কে একটি ধ্রুবক এবং স্থির অবস্থার মান সেট করে ট্রানজিস্টর Q-পয়েন্টকে সঠিকভাবে সেট করা।
এই স্টেডি-স্টেট বা ডিসি অপারেটিং পয়েন্ট সার্কিট ডিসি সাপ্লাই ভোল্টেজ (Vcc ) এর মান এবং ট্রানজিস্টর বেস টার্মিনালের সাথে সংযুক্ত যেকোনো বায়াসিং প্রতিরোধকের মান দ্বারা সেট করা হয়।
যেহেতু ট্রানজিস্টর বেস বায়াস কারেন্ট হল স্টেডি-স্টেট ডিসি স্রোত, তাই কাপলিং এবং বাইপাস ক্যাপাসিটরের উপযুক্ত ব্যবহার পরবর্তী ট্রানজিস্টর স্টেজ থেকে যেকোন বায়াসিং স্রোতকে ব্লক করতে সাহায্য করবে যা পরবর্তী বায়াস অবস্থাকে প্রভাবিত করে। বেস বায়াস নেটওয়ার্কগুলি কমন-বেস (সিবি), কমন-কালেক্টর (সিসি) বা কমন-ইমিটার (সিই) ট্রানজিস্টর কনফিগারেশনের জন্য ব্যবহার করা যেতে পারে। এই সাধারণ ট্রানজিস্টর বায়সিং টিউটোরিয়ালে আমরা একটি কমন ইমিটার অ্যামপ্লিফায়ারের জন্য উপলব্ধ বিভিন্ন বায়সিং ব্যবস্থাগুলি দেখব।

'''),
        Ingredent(02, 'একটি সাধারণ ইমিটার এম্প্লিফায়ার বেস বায়াসিং', '''

একটি ট্রানজিস্টর সার্কিটের জন্য প্রায়শই ব্যবহৃত বায়াসিং সার্কিটগুলির মধ্যে একটি হল ইমিটার-বায়াস সার্কিটের স্ব-বায়াসিং সহ তিনটি ট্রানজিস্টর কারেন্টের প্রাথমিক ডিসি মান সেট আপ করতে এক বা একাধিক বায়াসিং প্রতিরোধক ব্যবহার করা হয়, ( IB ), ( IC) এবং (IE)।
বাইপোলার ট্রানজিস্টর বায়াসিংয়ের দুটি সবচেয়ে সাধারণ রূপ হল: বিটা নির্ভরশীল এবং বিটা স্বাধীন। ট্রানজিস্টর বায়াস ভোল্টেজগুলি মূলত ট্রানজিস্টর বিটার উপর নির্ভরশীল, ( β ) তাই একটি ট্রানজিস্টরের জন্য বায়াসিং সেট আপ করা অন্য ট্রানজিস্টরের জন্য একই রকম নাও হতে পারে কারণ তাদের বিটা মান ভিন্ন হতে পারে। ট্রানজিস্টর বায়সিং একটি একক ফিড ব্যাক প্রতিরোধক ব্যবহার করে বা প্রয়োজনীয় বায়াসিং ভোল্টেজ প্রদানের জন্য একটি সাধারণ ভোল্টেজ ডিভাইডার নেটওয়ার্ক ব্যবহার করে অর্জন করা যেতে পারে।
নিম্নলিখিত একটি একক সরবরাহ (Vcc) থেকে ট্রানজিস্টর বেস বায়াস কনফিগারেশনের পাঁচটি উদাহরণ রয়েছে।


        একটি ট্রানজিস্টরের ফিক্সড বেস বায়াসিং

    দেখানো সার্কিটটিকে একটি "স্থির বেস বায়াস সার্কিট" বলা হয়, কারণ ট্রানজিস্টর বেস কারেন্ট, আইবি Vcc এর প্রদত্ত মানগুলির জন্য স্থির থাকে এবং সেইজন্য ট্রানজিস্টর অপারেটিং পয়েন্টকেও স্থির থাকতে হবে। এই দুটি প্রতিরোধক বায়াসিং নেটওয়ার্ক একটি নির্দিষ্ট বর্তমান বায়াস ব্যবহার করে ট্রানজিস্টরের প্রাথমিক অপারেটিং অঞ্চল স্থাপন করতে ব্যবহৃত হয়।
এই ধরনের ট্রানজিস্টর বায়াসিং বিন্যাসটিও বিটা-নির্ভর বায়াসিং কারণ অপারেশনের স্থির অবস্থা ট্রানজিস্টর বিটা β মানের একটি ফাংশন, তাই বায়াসিং পয়েন্ট একই ধরণের ট্রানজিস্টরের বৈশিষ্ট্যগুলির মতো বিস্তৃত পরিসরে পরিবর্তিত হবে। ট্রানজিস্টর ঠিক একই হবে না। ট্রানজিস্টরের ইমিটার ডায়োডটি বর্তমান লিমিটিং রেসিস্টর RB এর মাধ্যমে প্রয়োজনীয় ধনাত্মক বেস বায়াস ভোল্টেজ প্রয়োগ করে এগিয়ে পক্ষপাতী হয়। একটি আদর্শ বাইপোলার ট্রানজিস্টর ধরে নিলে, ফরোয়ার্ড বেস-ইমিটার ভোল্টেজ ড্রপ হবে 0.7V। তাহলে RB-এর মান হল সহজ: (VCC – VBE)/IB যেখানে IB কে IC/β হিসাবে সংজ্ঞায়িত করা হয়েছে।
এই একক প্রতিরোধক ধরণের বায়াসিং বিন্যাসের সাথে ট্রানজিস্টর অপারেশনের সময় বায়াসিং ভোল্টেজ এবং স্রোত স্থিতিশীল থাকে না এবং ব্যাপকভাবে পরিবর্তিত হতে পারে। এছাড়াও ট্রানজিস্টরের অপারেটিং তাপমাত্রা অপারেটিং পয়েন্টে বিরূপ প্রভাব ফেলতে পারে।    


      একটি ট্রানজিস্টরের কালেক্টর ফিডব্য়াক বায়াসিং

    এই সেলফ বায়াসিং কালেক্টর ফিডব্যাক কনফিগারেশন হল আরেকটি বিটা ডিপেন্ডেন্ট বায়াসিং পদ্ধতি যা ট্রানজিস্টরের জন্য প্রয়োজনীয় ডিসি বায়াস প্রদানের জন্য দুটি রেসিস্টরের প্রয়োজন। বেস ফিডব্যাক কনফিগারেশনের সংগ্রাহক নিশ্চিত করে যে বিটা (β) এর মান নির্বিশেষে ট্রানজিস্টর সর্বদা সক্রিয় অঞ্চলে পক্ষপাতদুষ্ট। ডিসি বেস বায়াস ভোল্টেজ সংগ্রাহক ভোল্টেজ ভিসি থেকে প্রাপ্ত হয়, এইভাবে ভাল স্থিতিশীলতা প্রদান করে।
এই সার্কিটে, বেস বায়াস রেসিস্টর, আরবি সাপ্লাই ভোল্টেজ রেল, ভিসিসির পরিবর্তে ট্রানজিস্টর কালেক্টর সি এর সাথে সংযুক্ত থাকে। এখন যদি সংগ্রাহক কারেন্ট বাড়ে, কালেক্টর ভোল্টেজ কমে যায়, বেস ড্রাইভ হ্রাস করে এবং এর ফলে স্বয়ংক্রিয়ভাবে ট্রানজিস্টর Q-পয়েন্ট স্থির রাখতে সংগ্রাহক কারেন্ট হ্রাস পায়। তাই সংগ্রাহক ফিডব্যাক বায়াসিংয়ের এই পদ্ধতিটি ট্রানজিস্টরের চারপাশে নেতিবাচক প্রতিক্রিয়া তৈরি করে কারণ আউটপুট টার্মিনাল থেকে রেসিস্টর, RB এর মাধ্যমে ইনপুট টার্মিনালে সরাসরি প্রতিক্রিয়া রয়েছে।
যেহেতু বায়াসিং ভোল্টেজটি লোড রেজিস্টর, RL জুড়ে ভোল্টেজ ড্রপ থেকে প্রাপ্ত হয়, যদি লোড কারেন্ট বাড়ে তাহলে RL জুড়ে একটি বড় ভোল্টেজ ড্রপ হবে এবং একটি অনুরূপ সংগ্রাহক ভোল্টেজ, VC হ্রাস পাবে। এই প্রভাবটি বেস কারেন্ট, আইবি-তে একটি সংশ্লিষ্ট ড্রপ ঘটাবে যা ঘুরে, আইসিকে স্বাভাবিক অবস্থায় ফিরিয়ে আনে।
বিপরীত প্রতিক্রিয়াও ঘটবে যখন ট্রানজিস্টর সংগ্রাহক কারেন্ট হ্রাস পাবে। তারপর বায়াসিংয়ের এই পদ্ধতিটিকে ট্রানজিস্টর স্থায়িত্বের সাথে সেলফ-বায়াসিং বলা হয় এই ধরনের ফিডব্যাক বায়াস নেটওয়ার্ক সাধারণত বেশিরভাগ অ্যামপ্লিফায়ার ডিজাইনের জন্য ভাল।


     ডুয়াল ফিডব্যাক ট্রানজিস্টর বায়াসিং

   পূর্ববর্তী কনফিগারেশনের বেস বায়াস নেটওয়ার্কে একটি অতিরিক্ত প্রতিরোধক যোগ করা বেটা বায়াসিং প্রতিরোধকের মধ্য দিয়ে প্রবাহিত কারেন্ট বাড়িয়ে বিটা, ( β ) এর বৈচিত্রের ক্ষেত্রে স্থিতিশীলতাকে আরও উন্নত করে।
RB1 এর মধ্য দিয়ে প্রবাহিত কারেন্ট সাধারণত সংগ্রাহক কারেন্ট, IC এর প্রায় 10% এর সমান একটি মান সেট করা হয়। স্পষ্টতই এটি বিটা, β-এর ন্যূনতম মানের জন্য প্রয়োজনীয় বেস কারেন্টের চেয়েও বেশি হতে হবে।
এই ধরনের সেলফ বায়াসিং কনফিগারেশনের একটি সুবিধা হল যে দুটি প্রতিরোধক একই সময়ে স্বয়ংক্রিয় বায়াসিং এবং Rƒ প্রতিক্রিয়া উভয়ই প্রদান করে।

    
     ইমিটার ফিডব্যাক সহ ট্রানজিস্টর বায়াসিং

  এই ধরনের ট্রানজিস্টর বায়সিং কনফিগারেশন, প্রায়ই সেলফ-ইমিটার বায়সিং বলা হয়, সংগ্রাহক কারেন্টকে আরও স্থিতিশীল করতে ইমিটার এবং বেস-সংগ্রাহক উভয় প্রতিক্রিয়া ব্যবহার করে। এর কারণ হল রেজিস্টর RB1 এবং RE পাশাপাশি ট্রানজিস্টরের বেস-ইমিটার জংশন সবই কার্যকরভাবে সাপ্লাই ভোল্টেজ, VCC এর সাথে সিরিজে যুক্ত। এই ইমিটার ফিডব্যাক কনফিগারেশনের নেতিবাচক দিক হল এটি বেস রেজিস্টর সংযোগের কারণে আউটপুট লাভ হ্রাস করে। সংগ্রাহক ভোল্টেজ ফিডব্যাক প্রতিরোধকের মধ্য দিয়ে প্রবাহিত কারেন্ট নির্ধারণ করে, RB1 উৎপন্ন করে যাকে "ডিজেনারেটিভ ফিডব্যাক" বলা হয়।
বিকিরণকারী থেকে প্রবাহিত কারেন্ট, IE (যা IC + IB-এর সংমিশ্রণ) এর ফলে RE জুড়ে এমন একটি দিকে ভোল্টেজ ড্রপ দেখা দেয় যে এটি বেস-ইমিটার জংশনকে বিপরীত পক্ষপাতিত্ব করে।
তাই যদি ইমিটার কারেন্ট বাড়ে, কালেক্টর কারেন্ট বৃদ্ধির কারণে, ভোল্টেজ ড্রপ I*REও বৃদ্ধি পায়। যেহেতু এই ভোল্টেজ রিভার্সের পোলারিটি বেস-ইমিটার জংশনকে পক্ষপাতিত্ব করে, তাই IB স্বয়ংক্রিয়ভাবে হ্রাস পায়। তাই নির্গমনকারী কারেন্ট বৃদ্ধির চেয়ে কম বৃদ্ধি পেত যদি কোন সেলফ বায়াসিং প্রতিরোধক না থাকে।
সাধারণত, রোধের মানগুলি সেট করা হয় যাতে ইমিটার রোধ RE জুড়ে ড্রপ হওয়া ভোল্টেজ VCC-এর প্রায় 10% হয় এবং রোধ RB1 এর মধ্য দিয়ে প্রবাহিত কারেন্ট সংগ্রাহক বর্তমান IC-এর 10% হয়।
সুতরাং এই ধরনের ট্রানজিস্টর বায়সিং কনফিগারেশন তুলনামূলকভাবে কম পাওয়ার সাপ্লাই ভোল্টেজে সবচেয়ে ভালো কাজ করে।


      ভোল্টেজ ডিভাইডার ট্রানজিস্টর বায়াসিং

   এখানে সাধারণ ইমিটার ট্রানজিস্টর কনফিগারেশন স্থায়িত্ব বাড়ানোর জন্য একটি ভোল্টেজ ডিভাইডার নেটওয়ার্ক ব্যবহার করে পক্ষপাতমূলক। এই বায়াসিং কনফিগারেশনের নাম এই সত্য থেকে এসেছে যে RB1 এবং RB2 দুটি প্রতিরোধক একটি ভোল্টেজ বা সম্ভাব্য বিভাজক নেটওয়ার্ক গঠন করে সরবরাহ জুড়ে তাদের কেন্দ্র বিন্দু জংশনের সাথে ট্রানজিস্টর বেস টার্মিনালকে দেখানো হয়েছে।
এই ভোল্টেজ ডিভাইডার বায়াসিং কনফিগারেশন হল সবচেয়ে বেশি ব্যবহৃত ট্রানজিস্টর বায়সিং পদ্ধতি। ট্রানজিস্টরের ইমিটার ডায়োডটি রোধ RB2 জুড়ে বিকশিত ভোল্টেজ মান দ্বারা পক্ষপাতদুষ্ট। এছাড়াও, ভোল্টেজ ডিভাইডার নেটওয়ার্ক বায়াসিং ট্রানজিস্টর সার্কিটকে বিটা পরিবর্তনের থেকে স্বাধীন করে তোলে কারণ ট্রানজিস্টর বেস, ইমিটার এবং কালেক্টর টার্মিনালগুলিতে সেট করা বায়াসিং ভোল্টেজগুলি বহিরাগত সার্কিট মানের উপর নির্ভরশীল নয়।
রোধ RB2 জুড়ে বিকশিত ভোল্টেজ গণনা করতে এবং সেইজন্য বেস টার্মিনালে প্রয়োগ করা ভোল্টেজ আমরা কেবল সিরিজে প্রতিরোধকের জন্য ভোল্টেজ বিভাজক সূত্র ব্যবহার করি।
সাধারণত রোধ RB2 জুড়ে ভোল্টেজ ড্রপ রোধ RB1 এর তুলনায় অনেক কম। স্পষ্টতই ট্রানজিস্টর বেস ভোল্টেজ VB স্থলের সাপেক্ষে, RB2 জুড়ে ভোল্টেজের সমান হবে।
রোধ RB2 এর মধ্য দিয়ে প্রবাহিত বায়াসিং কারেন্টের পরিমাণ সাধারণত প্রয়োজনীয় বেস কারেন্ট IB-এর মানের 10 গুণে সেট করা হয় যাতে এটি যথেষ্ট পরিমাণে উচ্চ হয় যাতে ভোল্টেজ ডিভাইডার কারেন্ট বা বিটাতে পরিবর্তনের উপর কোন প্রভাব না পড়ে।
ট্রানজিস্টর বায়সিং এর লক্ষ্য হল একটি পরিচিত শান্ত অপারেটিং পয়েন্ট, বা বাইপোলার ট্রানজিস্টরকে দক্ষতার সাথে কাজ করার জন্য এবং একটি অবিকৃত আউটপুট সিগন্যাল তৈরি করার জন্য Q-পয়েন্ট স্থাপন করা। ট্রানজিস্টরের সঠিক ডিসি বায়াসিং এর প্রারম্ভিক এসি অপারেটিং অঞ্চলকেও দুই বা চার-প্রতিরোধক বায়াস নেটওয়ার্ক ব্যবহার করে ব্যবহারিক বায়াসিং সার্কিট দিয়ে স্থাপন করে।
বাইপোলার ট্রানজিস্টর সার্কিটে, Q-পয়েন্ট NPN ট্রানজিস্টরের জন্য (VCE, IC ) অথবা PNP ট্রানজিস্টরের জন্য (VEC, IC) দ্বারা উপস্থাপিত হয়। বেস বায়াস নেটওয়ার্কের স্থায়িত্ব এবং সেইজন্য Q-পয়েন্ট সাধারণত কালেক্টর কারেন্টকে বিটা (β) এবং তাপমাত্রা উভয়ের কাজ হিসাবে বিবেচনা করে মূল্যায়ন করা হয়।
এখানে আমরা প্রতিরোধী নেটওয়ার্ক ব্যবহার করে "একটি ট্রানজিস্টরকে পক্ষপাতদুষ্ট করার" জন্য পাঁচটি ভিন্ন কনফিগারেশনের দিকে সংক্ষেপে দেখেছি। কিন্তু আমরা ট্রানজিস্টর বেস টার্মিনালের সাথে সংযুক্ত সিলিকন ডায়োড, জেনার ডায়োড বা সক্রিয় নেটওয়ার্ক ব্যবহার করে একটি ট্রানজিস্টরকে পক্ষপাতিত্বও করতে পারি। আমরা চাইলে ডুয়াল ভোল্টেজ পাওয়ার সাপ্লাই থেকে ট্রানজিস্টরকে সঠিকভাবে পক্ষপাতিত্ব করতে পারি।   


'''),
        Ingredent(03, 'ইমিটার রেজিস্ট্যান্সি', '''
        একটি ট্রানজিস্টর অ্যামপ্লিফায়ারের ইমিটার টার্মিনালের সাথে সংযুক্ত ইমিটার রেজিস্ট্যান্স অ্যামপ্লিফায়ার বায়াস স্থিতিশীলতা বাড়াতে ব্যবহার করা যেতে পারে। একটি AC সংকেত পরিবর্ধক সার্কিটের লক্ষ্য হল DC পক্ষপাতমূলক ইনপুট ভোল্টেজকে এমপ্লিফায়ারে স্থিতিশীল করা এবং এইভাবে শুধুমাত্র প্রয়োজনীয় AC সংকেতকে প্রশস্ত করা।
  এই স্থিতিশীলতা একটি ইমিটার রেজিস্ট্যান্স ব্যবহার করে অর্জন করা হয় যা একটি সাধারণ ইমিটার এম্প্লিফায়ারের জন্য প্রয়োজনীয় পরিমাণ স্বয়ংক্রিয় বায়াসিং প্রদান করে। এটাকে আরেকটু ব্যাখ্যা করতে নিচের বেসিক এমপ্লিফায়ার সার্কিটটি বিবেচনা করুন।


        বেসিক কমন ইমিটার এমপ্লিফায়ার সার্কিট
     
    দেখানো সাধারণ ইমিটার অ্যামপ্লিফায়ার সার্কিট ট্রানজিস্টর বেসকে পক্ষপাতিত্ব করতে একটি ভোল্টেজ ডিভাইডার নেটওয়ার্ক ব্যবহার করে এবং সাধারণ ইমিটার কনফিগারেশন বাইপোলার ট্রানজিস্টর অ্যামপ্লিফায়ার সার্কিট ডিজাইন করার একটি খুব জনপ্রিয় উপায়। এই সার্কিটের একটি গুরুত্বপূর্ণ বৈশিষ্ট্য হল ট্রানজিস্টরের গোড়ায় প্রশংসনীয় পরিমাণ কারেন্ট প্রবাহিত হয়। R1 এবং R2 দুটি বায়াসিং প্রতিরোধকের সংযোগস্থলের ভোল্টেজ, ট্রানজিস্টর বেস ভোল্টেজ, VB একটি ধ্রুবক ভোল্টেজে এবং সরবরাহ ভোল্টেজের সমানুপাতিক, Vcc ধারণ করে। মনে রাখবেন যে VB হল ভিত্তি থেকে স্থল পর্যন্ত পরিমাপ করা ভোল্টেজ, যা R2 জুড়ে প্রকৃত ভোল্টেজ ড্রপ।
  এই "ক্লাস-এ" টাইপ অ্যামপ্লিফায়ার সার্কিটটি সর্বদা এমনভাবে ডিজাইন করা হয় যাতে বেস কারেন্ট (Ib ) বায়াসিং রেসিস্টর R2 এর মধ্য দিয়ে প্রবাহিত কারেন্টের 10% এর কম হয়। সুতরাং উদাহরণস্বরূপ, যদি আমাদের 1mΑ এর একটি শান্ত সংগ্রাহক কারেন্টের প্রয়োজন হয়, তাহলে বেস কারেন্ট, IB হবে এর একশত ভাগ বা 10μΑ। তাই সম্ভাব্য বিভাজক নেটওয়ার্কের রোধ R2 এর মধ্য দিয়ে প্রবাহিত কারেন্ট অবশ্যই এই পরিমাণের কমপক্ষে 10 গুণ বা 100μΑ হতে হবে।
একটি ভোল্টেজ বিভাজক ব্যবহার করার সুবিধা এর স্থায়িত্বের মধ্যে রয়েছে। যেহেতু R1 এবং R2 দ্বারা গঠিত ভোল্টেজ বিভাজকটি হালকাভাবে লোড করা হয়েছে, তাই বেস ভোল্টেজ, Vb সহজেই গণনা করা যেতে পারে দেখানো হিসাবে সহজ ভোল্টেজ বিভাজক সূত্র ব্যবহার করে।   


       ইমিটার রেজিস্ট্যান্স স্ট্যাবিলাইজেশন

   দেখানো হিসাবে ট্রানজিস্টর ইমিটার সার্কিটে একটি একক প্রতিরোধক স্থাপন করে এমপ্লিফায়ার বায়াস ভোল্টেজকে স্থিতিশীল করা যেতে পারে। এই রোধ ইমিটার রেজিস্ট্যান্স, RE নামে পরিচিত। এই ইমিটার রেসিস্টর যোগ করার অর্থ হল ট্রানজিস্টর ইমিটার টার্মিনালটি আর গ্রাউন্ডেড বা শূন্য ভোল্ট পটেনশিয়াল নয় বরং এটির ওহমস ল সমীকরণ দ্বারা প্রদত্ত একটি ছোট পটেনশিয়ালে বসে: VE = IE x RE। কোথায়: IE হল প্রকৃত ইমিটার কারেন্ট।
এখন যদি সাপ্লাই ভোল্টেজ Vcc বৃদ্ধি পায়, তাহলে প্রদত্ত লোড রেজিস্ট্যান্সের জন্য ট্রানজিস্টর কালেক্টর কারেন্ট আইসিও বৃদ্ধি পায়। যদি সংগ্রাহক কারেন্ট বৃদ্ধি পায়, তাহলে সংশ্লিষ্ট ইমিটার কারেন্টও অবশ্যই বৃদ্ধি পাবে যার ফলে RE জুড়ে ভোল্টেজ ড্রপ বৃদ্ধি পাবে। এই ক্রিয়াটির ফলে বেস ভোল্টেজের আনুপাতিক বৃদ্ধি ঘটে কারণ VB = VE + VBE
যেহেতু বেস ভোল্টেজ বিভাজক প্রতিরোধক R1 এবং R2 দ্বারা ধ্রুবক ধরে রাখা হয়, তাই নির্গতকারী Vbe-এর সাপেক্ষে বেসের উপর DC ভোল্টেজ একটি আনুপাতিক পরিমাণে কমানো হয় এইভাবে বেস কারেন্ট ড্রাইভ হ্রাস করে এবং সংগ্রাহক কারেন্টকে আরও বাড়তে না দেয়। সরবরাহ ভোল্টেজ এবং সংগ্রাহক বর্তমান মান হ্রাস করার চেষ্টা করলে অনুরূপ ক্রিয়া ঘটে। অন্য কথায়, এই ইমিটার টার্মিনাল রেজিস্ট্যান্সের সংযোজন নেতিবাচক প্রতিক্রিয়া ব্যবহার করে ট্রানজিস্টর বেস বায়াসিং নিয়ন্ত্রণ করতে সাহায্য করে, যা বেস বায়াস ভোল্টেজের বিপরীত পরিবর্তনের সাথে সংগ্রাহক কারেন্টের যেকোনো প্রচেষ্টা পরিবর্তনকে অস্বীকার করে এবং তাই সার্কিট একটি নির্দিষ্ট স্তরে স্থিতিশীল হতে থাকে। .
এছাড়াও, যেহেতু সরবরাহের কিছু অংশ RE জুড়ে ড্রপ করা হয়, তাই এর মান যতটা সম্ভব ছোট হওয়া উচিত যাতে লোড রেজিস্ট্যান্স, RL এবং সেই কারণে আউটপুট জুড়ে সবচেয়ে বড় সম্ভাব্য ভোল্টেজ তৈরি করা যায়। যাইহোক, এর মান খুব ছোট হতে পারে না বা আবার সার্কিটের অস্থিরতা ক্ষতিগ্রস্ত হবে।
তারপরে ইমিটার রোধের মধ্য দিয়ে প্রবাহিত কারেন্টকে গণনা করা হয়:  


        ইমিটার রেজিস্টর কারেন্ট

            Ie = Ve/Re = Vb-Vbe/Re

     একটি সাধারণ নিয়ম হিসাবে, এই ইমিটার রেজিস্ট্যান্স জুড়ে ভোল্টেজ ড্রপকে সাধারণত: Vb - Vbe, বা সাপ্লাই ভোল্টেজের মানের এক-দশমাংশ (1/10তম), Vcc হিসাবে নেওয়া হয়। ইমিটার রেসিস্টর ভোল্টেজের একটি সাধারণ চিত্র হল 1 থেকে 2 ভোল্টের মধ্যে, যেটি কম। ইমিটার রেজিস্ট্যান্সের মান, Re লাভ থেকেও পাওয়া যেতে পারে কারণ এখন AC ভোল্টেজ লাভ সমান: Rl/Re       


       ইমিটার বাই-পাস ক্যাপাসিটর


   উপরের বেসিক সিরিজ ফিডব্যাক সার্কিটে, ইমিটার রেজিস্টর, RE দুটি কাজ করে: স্থিতিশীল পক্ষপাতের জন্য DC নেতিবাচক প্রতিক্রিয়া এবং সিগন্যাল ট্রান্সকন্ডাক্টেন্স এবং ভোল্টেজ লাভ স্পেসিফিকেশনের জন্য AC নেতিবাচক প্রতিক্রিয়া। কিন্তু যেহেতু ইমিটার রেজিস্ট্যান্স একটি ফিডব্যাক রেজিস্টর, তাই এসি ইনপুট সিগন্যালের কারণে ইমিটার কারেন্ট IE এর ওঠানামার কারণে এটি এমপ্লিফায়ার লাভকেও কমিয়ে দেবে। এই সমস্যাটি কাটিয়ে ওঠার জন্য একটি ক্যাপাসিটর, যাকে "ইমিটার বাইপাস ক্যাপাসিটর" বলা হয়, সিই ইমিটার রেজিস্ট্যান্স জুড়ে দেখানো হয়েছে। এই বাইপাস ক্যাপাসিটরের কারণে অ্যামপ্লিফায়ারের ফ্রিকোয়েন্সি রেসপন্স একটি নির্ধারিত কাট-অফ ফ্রিকোয়েন্সি, ƒc, বাই-পাসিং (অতএব এটির নাম) সিগন্যাল স্রোত স্থলে ভেঙ্গে যায়।
ক্যাপাসিটর হওয়ার কারণে এটি ডিসি পক্ষপাতের জন্য একটি ওপেন সার্কিট হিসাবে প্রদর্শিত হয় এবং তাই, বাইপাস ক্যাপাসিটর যোগ করার মাধ্যমে পক্ষপাতদুষ্ট স্রোত এবং ভোল্টেজগুলি প্রভাবিত হয় না। ফ্রিকোয়েন্সিগুলির পরিবর্ধক অপারেটিং পরিসরের উপর, ক্যাপাসিটারের প্রতিক্রিয়া, XC কম ফ্রিকোয়েন্সিগুলিতে অত্যন্ত উচ্চ হবে যা একটি নেতিবাচক প্রতিক্রিয়ার প্রভাব তৈরি করে, অ্যামপ্লিফায়ার লাভ হ্রাস করে।
এই বাইপাস ক্যাপাসিটর CE-এর মান সাধারণত সবচেয়ে কম কাট-অফ ফ্রিকোয়েন্সি পয়েন্টে বিকিরণকারী রোধ RE-এর মানের এক-দশমাংশ (1/10তম) ক্যাপাসিটিভ বিক্রিয়া প্রদানের জন্য বেছে নেওয়া হয়। তারপর অনুমান করা হচ্ছে যে সর্বনিম্ন সংকেত ফ্রিকোয়েন্সি 100 হবে।


      স্প্লিট ইমিটার এম্প্লিফায়ার
     
  স্প্লিট এমিট বাইপাস ক্যাপাসিটর সংযোজন করার সময়, সিই বিটা, ( β ) এর অনিশ্চয়তার প্রভাব মোকাবেলা করে পরিবর্ধক লাভ নিয়ন্ত্রণ করতে সাহায্য করে, ( β ), এর প্রধান অসুবিধাগুলির মধ্যে একটি হল উচ্চ ফ্রিকোয়েন্সিতে ক্যাপাসিটর বিক্রিয়া এত কম হয়ে যায় যে এটি কার্যকরভাবে শর্ট করে। বিকিরণ প্রতিরোধের আউট, ফ্রিকোয়েন্সি বৃদ্ধি হিসাবে RE.
ফলাফল হল যে উচ্চ ফ্রিকোয়েন্সিতে ক্যাপাসিটরের বিক্রিয়া খুব কম AC ফিডব্যাক নিয়ন্ত্রণের অনুমতি দেয় কারণ RE কমিয়ে দেওয়া হয় যার অর্থ হল ট্রানজিস্টরের AC ভোল্টেজ লাভ ব্যাপকভাবে বৃদ্ধি পায় যা পরিবর্ধককে স্যাচুরেশনে নিয়ে যায়।
সম্পূর্ণ অপারেটিং ফ্রিকোয়েন্সি রেঞ্জের উপর অ্যামপ্লিফায়ার লাভ নিয়ন্ত্রণ করার একটি সহজ উপায় হল বিকিরণ প্রতিরোধকে দুটি অংশে বিভক্ত করা যেমন দেখানো হয়েছে।


      স্প্লিট ইমিটার রেজিস্টর

    ইমিটার লেগের রোধকে দুটি ভাগে বিভক্ত করা হয়েছে: RE1 এবং RE2 নিম্ন রোধ জুড়ে সমান্তরালভাবে সংযুক্ত বাই-পাস ক্যাপাসিটর সহ ইমিটার পায়ের মধ্যে একটি ভোল্টেজ বিভাজক নেটওয়ার্ক তৈরি করে।
উপরের রোধ, RE1 আগের মতই একই মান কিন্তু ক্যাপাসিটর দ্বারা বাইপাস করা হয় না তাই সিগন্যাল প্যারামিটার গণনা করার সময় অবশ্যই বিবেচনা করা উচিত। নিম্ন রোধ RE2 ক্যাপাসিটরের সাথে সমান্তরালভাবে সংযুক্ত থাকে এবং সিগন্যাল প্যারামিটার গণনা করার সময় এটিকে শূন্য ওহম হিসাবে বিবেচনা করা হয় কারণ এটি উচ্চ ফ্রিকোয়েন্সিতে ছোট হয়ে যায়।
এখানে সুবিধা হল যে আমরা ইনপুট ফ্রিকোয়েন্সিগুলির সম্পূর্ণ পরিসরের উপর পরিবর্ধকের AC লাভ নিয়ন্ত্রণ করতে পারি। DC-তে ইমিটার রেজিস্ট্যান্সের মোট মান RE1 + RE2 এর সমান যখন উচ্চতর AC ফ্রিকোয়েন্সিতে ইমিটার রেজিস্ট্যান্স ঠিক থাকে: RE1, উপরের মূল আনবাইপাসড সার্কিটে যেমন ছিল।
তাহলে রোধের মান কি, RE2। ভাল এটি নির্ভর করবে নিম্ন ফ্রিকোয়েন্সি কাট-অফ পয়েন্টে প্রয়োজনীয় ডিসি ভোল্টেজ লাভের উপর। আমরা আগে বলেছিলাম যে উপরের সার্কিটের লাভ সমান ছিল: RL/RE যা উপরের আমাদের সাধারণ ইমিটার সার্কিটের জন্য 10 (1kΩ/100Ω) গণনা করা হয়েছিল। কিন্তু এখন DC-তে লাভ হবে সমান: RL / (RE1 + RE2)


    ইমিটার রেজিস্ট্যান্স সারাংশ

  তারপরে সংক্ষেপে বলতে গেলে, একটি ট্রানজিস্টরের বর্তমান পরিবর্ধন প্যারামিটার, β উত্পাদন সহনশীলতার কারণে এবং সরবরাহ ভোল্টেজ এবং অপারেটিং তাপমাত্রার তারতম্যের কারণে একই ধরণের এবং অংশ সংখ্যার একটি ডিভাইস থেকে অন্য ডিভাইসে উল্লেখযোগ্যভাবে পরিবর্তিত হতে পারে।
তারপর একটি সাধারণ ইমিটার ক্লাস-এ এমপ্লিফায়ার সার্কিটের জন্য একটি বায়াসিং সার্কিট ব্যবহার করা প্রয়োজন যা অপারেটিং Q-পয়েন্টকে স্থিতিশীল করবে যা ডিসি কালেক্টর কারেন্ট, আইসি বিটা থেকে স্বাধীন। স্থিতিশীলতা প্রদানের জন্য বিকিরণকারী পায়ে একটি ইমিটার রেজিস্ট্যান্স, RE যোগ করে ইমিটার কারেন্টের মানের উপর β-এর প্রভাব হ্রাস করা যেতে পারে।
এই ইমিটার রেজিস্ট্যান্স জুড়ে ভোল্টেজ ড্রপ সাধারণত 1 থেকে 2 ভোল্টের মধ্যে দেওয়া হয়। ইমিটার রোধকে একটি উপযুক্ত বাইপাস ক্যাপাসিটর দ্বারা সম্পূর্ণরূপে বাইপাস করা যেতে পারে, সিই উচ্চতর এসি লাভ অর্জনের জন্য ইমিটার রোধের সাথে সমান্তরালভাবে সংযুক্ত বা আংশিকভাবে বাইপাস করে, একটি স্প্লিট-ইমিটার ভোল্টেজ বিভাজক নেটওয়ার্ক ব্যবহার করে যা DC লাভ এবং বিকৃতি হ্রাস করে। এই ক্যাপাসিটরের মান সর্বনিম্ন সংকেত ফ্রিকোয়েন্সিতে এর ক্যাপাসিটিভ রিঅ্যাক্ট্যান্স (XC) মান থেকে নির্ধারিত হয়।


   ক্লাস এ এমপ্লিফায়ার

    উচ্চ রৈখিকতা এবং লাভ অর্জনের জন্য, একটি ক্লাস A পরিবর্ধকের আউটপুট পর্যায়টি সর্বদা "চালু" (পরিচালনা) পক্ষপাতমূলক থাকে। তারপরে একটি পরিবর্ধককে "ক্লাস A" হিসাবে শ্রেণীবদ্ধ করার জন্য আউটপুট পর্যায়ে শূন্য সংকেত নিষ্ক্রিয় কারেন্ট অবশ্যই সর্বাধিক লোড কারেন্ট (সাধারণত একটি লাউডস্পীকার) বৃহত্তম আউটপুট সংকেত তৈরি করতে প্রয়োজনীয় সমান বা তার চেয়ে বেশি হতে হবে।
একটি ক্লাস A পরিবর্ধক তার বৈশিষ্ট্যযুক্ত বক্ররেখার রৈখিক অংশে কাজ করে, একক আউটপুট ডিভাইসটি আউটপুট তরঙ্গরূপের সম্পূর্ণ 360 ডিগ্রির মাধ্যমে সঞ্চালিত হয়। তারপর ক্লাস A পরিবর্ধক একটি বর্তমান উৎসের সমতুল্য।
যেহেতু একটি শ্রেণী A পরিবর্ধক রৈখিক অঞ্চলে কাজ করে, তাই ট্রানজিস্টর বেস (বা গেট) ডিসি বায়সিং ভোল্টেজ সঠিক অপারেশন এবং কম বিকৃতি নিশ্চিত করার জন্য সঠিকভাবে বেছে নেওয়া উচিত। যাইহোক, যেহেতু আউটপুট ডিভাইসটি সর্বদা "চালু" থাকে, এটি ক্রমাগত কারেন্ট বহন করে, যা অ্যামপ্লিফায়ারে ক্রমাগত শক্তি হ্রাসকে প্রতিনিধিত্ব করে।
এই ক্রমাগত পাওয়ার ক্লাসের ক্ষতির কারণে A অ্যামপ্লিফায়ারগুলি প্রচুর পরিমাণে তাপ তৈরি করে যা তাদের খুব কম কার্যক্ষমতা প্রায় 30% এ যোগ করে, যা উচ্চ-শক্তি পরিবর্ধনের জন্য তাদের অবাস্তব করে তোলে। এছাড়াও অ্যামপ্লিফায়ারের উচ্চ নিষ্ক্রিয় কারেন্টের কারণে, পাওয়ার সাপ্লাইকে অবশ্যই সেই অনুযায়ী মাপ করা উচিত এবং কোনও অ্যামপ্লিফায়ার হুম এবং শব্দ এড়াতে ভালভাবে ফিল্টার করা উচিত। অতএব, ক্লাস A পরিবর্ধকগুলির কম দক্ষতা এবং অতিরিক্ত গরম করার সমস্যার কারণে, আরও দক্ষ পরিবর্ধক ক্লাস তৈরি করা হয়েছে।


  ক্লাস বি এমপ্লিফায়ার

   
   ক্লাস B পরিবর্ধক পূর্ববর্তী শ্রেণীর A পরিবর্ধকের সাথে সম্পর্কিত দক্ষতা এবং গরম করার সমস্যার সমাধান হিসাবে উদ্ভাবিত হয়েছিল। বেসিক ক্লাস B অ্যামপ্লিফায়ার দুটি কমপ্লিমেন্টারি ট্রানজিস্টর ব্যবহার করে ওয়েভফর্মের প্রতিটি অর্ধেকের জন্য FET-এর বাইপোলার যার আউটপুট স্টেজ একটি "পুশ-পুল" টাইপ বিন্যাসে কনফিগার করা হয়েছে, যাতে প্রতিটি ট্রানজিস্টর ডিভাইস আউটপুট তরঙ্গরূপের মাত্র অর্ধেককে প্রশস্ত করে।
ক্লাস B এম্প্লিফায়ারে, কোন DC বেস বায়াস কারেন্ট নেই কারণ এর শান্ত কারেন্ট শূন্য, যাতে dc শক্তি ছোট এবং তাই এর কার্যকারিতা A ক্লাস এম্প্লিফায়ারের তুলনায় অনেক বেশি। যাইহোক, দক্ষতার উন্নতির জন্য প্রদত্ত মূল্যটি সুইচিং ডিভাইসের রৈখিকতার মধ্যে রয়েছে। নেতিবাচক ট্রানজিস্টর "বন্ধ" সুইচ করা হয়. একইভাবে, যখন ইনপুট সিগন্যাল নেগেটিভ হয়ে যায়, তখন ইতিবাচক ট্রানজিস্টর "অফ" করে যখন নেতিবাচক পক্ষপাতদুষ্ট ট্রানজিস্টর "অন" করে এবং সিগন্যালের নেতিবাচক অংশ পরিচালনা করে। এইভাবে ট্রানজিস্টর ইনপুট সিগন্যালের ইতিবাচক বা নেতিবাচক অর্ধচক্রে মাত্র অর্ধেক সময় পরিচালনা করে।
তারপরে আমরা দেখতে পাব যে ক্লাস B পরিবর্ধকের প্রতিটি ট্রানজিস্টর ডিভাইস কঠোর সময়ের পরিবর্তনে আউটপুট তরঙ্গরূপের মাত্র এক অর্ধেক বা 180 ডিগ্রির মধ্য দিয়ে সঞ্চালিত হয়, কিন্তু আউটপুট পর্যায়ে সিগন্যাল তরঙ্গরূপের উভয় অর্ধাংশের জন্য ডিভাইস রয়েছে বলে দুটি অর্ধেক একত্রিত হয়। সম্পূর্ণ লিনিয়ার আউটপুট তরঙ্গরূপ উত্পাদন করতে।
অ্যামপ্লিফায়ারের এই পুশ-পুল ডিজাইন স্পষ্টতই ক্লাস A-এর তুলনায় প্রায় 50% বেশি দক্ষ, কিন্তু ক্লাস B অ্যামপ্লিফায়ার ডিজাইনের সমস্যা হল যে এটি ট্রানজিস্টর ডেড ব্যান্ডের কারণে তরঙ্গরূপের জিরো-ক্রসিং পয়েন্টে বিকৃতি তৈরি করতে পারে। ইনপুট বেস ভোল্টেজ -0.7V থেকে +0.7 পর্যন্ত।
আমরা ট্রানজিস্টর টিউটোরিয়াল থেকে মনে রাখি যে একটি বাইপোলার ট্রানজিস্টর পরিচালনা শুরু করতে এটি প্রায় 0.7 ভোল্টের একটি বেস-ইমিটার ভোল্টেজ নেয়। তারপর একটি ক্লাস B পরিবর্ধক, আউটপুট ট্রানজিস্টর এই ভোল্টেজ অতিক্রম না হওয়া পর্যন্ত অপারেশনের একটি "অন" অবস্থায় "পক্ষপাতমূলক" হয় না।
এর মানে হল যে তরঙ্গরূপের যে অংশটি এই 0.7 ভোল্টের উইন্ডোর মধ্যে পড়ে তা সঠিকভাবে পুনরুত্পাদন করা হবে না যার ফলে ক্লাস B পরিবর্ধক নির্ভুল অডিও অ্যামপ্লিফায়ার অ্যাপ্লিকেশনের জন্য অনুপযুক্ত হবে।
এই শূন্য-ক্রসিং বিকৃতিকে কাটিয়ে উঠতে (এছাড়াও ক্রসওভার ডিস্টরশন নামেও পরিচিত) ক্লাস এবি অ্যামপ্লিফায়ার তৈরি করা হয়েছিল।


  ক্লাস এবি এমপ্লিফায়ার
   
   এর নাম অনুসারে, ক্লাস এবি অ্যামপ্লিফায়ার হল "ক্লাস এ" এবং "ক্লাস বি" টাইপ অ্যামপ্লিফায়ারগুলির সংমিশ্রণ যা আমরা উপরে দেখেছি। অ্যামপ্লিফায়ারের AB শ্রেণীবিভাগ বর্তমানে অডিও পাওয়ার অ্যামপ্লিফায়ার ডিজাইনের সবচেয়ে সাধারণ ব্যবহৃত ধরনের একটি। ক্লাস AB পরিবর্ধক হল উপরে বর্ণিত একটি ক্লাস B পরিবর্ধকের একটি বৈচিত্র, ব্যতীত উভয় ডিভাইসকে একই সময়ে তরঙ্গরূপ ক্রসওভার পয়েন্টের চারপাশে পরিচালনা করার অনুমতি দেওয়া হয় যা পূর্ববর্তী ক্লাস B পরিবর্ধকের ক্রসওভার বিকৃতির সমস্যা দূর করে।
দুটি ট্রানজিস্টরের একটি খুব ছোট বায়াস ভোল্টেজ রয়েছে, সাধারণত 5 থেকে 10% শান্ত স্রোত ট্রানজিস্টরকে তার কাট-অফ পয়েন্টের ঠিক উপরে পক্ষপাতিত্ব করার জন্য। তারপর কন্ডাক্টিং ডিভাইস, হয় FET-এর বাইপোলার, এক অর্ধেক চক্রের জন্য "চালু" থাকবে, কিন্তু ইনপুট সিগন্যালের একটি পূর্ণ চক্রের চেয়ে অনেক কম। অতএব, একটি শ্রেণী AB পরিবর্ধক ডিজাইনে প্রতিটি পুশ-পুল ট্রানজিস্টর B শ্রেণীতে পরিবাহনের অর্ধচক্রের থেকে সামান্য বেশি সময় পরিবাহিত হয়, কিন্তু A শ্রেণীর পরিবাহনের সম্পূর্ণ চক্রের তুলনায় অনেক কম।
অন্য কথায়, একটি শ্রেণী AB পরিবর্ধক এর পরিবাহী কোণ 180o এবং 360o এর মধ্যে রয়েছে যা দেখানো হয়েছে নির্বাচিত বায়াস পয়েন্টের উপর নির্ভর করে। সিরিজ ডায়োড বা প্রতিরোধক দ্বারা প্রদত্ত এই ছোট পক্ষপাত ভোল্টেজের সুবিধা হল যে ক্লাস B পরিবর্ধক বৈশিষ্ট্য দ্বারা সৃষ্ট ক্রসওভার বিকৃতিটি কাটিয়ে উঠতে পারে, ক্লাস A পরিবর্ধক ডিজাইনের অদক্ষতা ছাড়াই। সুতরাং শ্রেণী AB পরিবর্ধকটি দক্ষতা এবং রৈখিকতার পরিপ্রেক্ষিতে ক্লাস A এবং ক্লাস B এর মধ্যে একটি ভাল সমঝোতা, যার রূপান্তর দক্ষতা প্রায় 50% থেকে 60% পর্যন্ত পৌঁছেছে।


  ক্লাস সি এমপ্লিফায়ার

  ক্লাস সি অ্যামপ্লিফায়ার ডিজাইনের সবচেয়ে বেশি দক্ষতা রয়েছে কিন্তু এখানে উল্লেখ করা অ্যামপ্লিফায়ারগুলির ক্লাসগুলির মধ্যে সবচেয়ে দুর্বল রৈখিকতা। পূর্ববর্তী শ্রেণী, A, B এবং AB রৈখিক পরিবর্ধক হিসাবে বিবেচিত হয়, কারণ আউটপুট সংকেত প্রশস্ততা এবং ফেজ রৈখিকভাবে ইনপুট সংকেত প্রশস্ততা এবং পর্বের সাথে সম্পর্কিত।
যাইহোক, ক্লাস C পরিবর্ধকটি অত্যন্ত পক্ষপাতদুষ্ট যাতে একটি ইনপুট সাইনোসয়েডাল সিগন্যাল চক্রের অর্ধেকেরও বেশি সময় আউটপুট কারেন্ট শূন্য থাকে যার কাট-অফ পয়েন্টে ট্রানজিস্টর অলস থাকে। অন্য কথায়, ট্রানজিস্টরের জন্য পরিবাহী কোণ উল্লেখযোগ্যভাবে 180 ডিগ্রির চেয়ে কম, এবং সাধারণত 90 ডিগ্রি এলাকার কাছাকাছি।
যদিও ট্রানজিস্টর বায়াসিংয়ের এই ফর্মটি এমপ্লিফায়ারকে প্রায় 80% এর অনেক উন্নত দক্ষতা দেয়, এটি আউটপুট সিগন্যালের একটি খুব ভারী বিকৃতি প্রবর্তন করে। অতএব, ক্লাস সি পরিবর্ধক অডিও পরিবর্ধক হিসাবে ব্যবহারের জন্য উপযুক্ত নয়। এর ভারী অডিও বিকৃতির কারণে, ক্লাস সি পরিবর্ধকগুলি সাধারণত উচ্চ ফ্রিকোয়েন্সি সাইন ওয়েভ অসিলেটর এবং নির্দিষ্ট ধরণের রেডিও ফ্রিকোয়েন্সি অ্যামপ্লিফায়ারগুলিতে ব্যবহৃত হয়, যেখানে অ্যামপ্লিফায়ার আউটপুটে উত্পাদিত কারেন্টের স্পন্দনগুলি একটি নির্দিষ্ট ফ্রিকোয়েন্সির সম্পূর্ণ সাইন তরঙ্গে রূপান্তরিত হতে পারে। এর সংগ্রাহক সার্কিটে এলসি রেজোন্যান্ট সার্কিট ব্যবহার।


  এমপ্লিফায়ার ক্লাস সারাংশ

তারপরে আমরা দেখেছি যে একটি অ্যামপ্লিফায়ারের শান্ত ডিসি অপারেটিং পয়েন্ট (কিউ-পয়েন্ট) পরিবর্ধক শ্রেণিবিন্যাস নির্ধারণ করে। পরিবর্ধক বৈশিষ্ট্য বক্ররেখার লোড লাইনের অর্ধেক পথে Q-পয়েন্টের অবস্থান নির্ধারণ করে, পরিবর্ধকটি একটি শ্রেণি 
A পরিবর্ধক হিসাবে কাজ করবে। Q-পয়েন্টকে নিচের দিকে সরানোর মাধ্যমে লোড লাইনটি পরিবর্ধককে AB, B বা C শ্রেণীতে পরিবর্তিত করে। অডিও অ্যামপ্লিফায়ারগুলির পাশাপাশি অ্যামপ্লিফায়ার ডিজাইনের সুইচিং সম্পর্কিত অনেকগুলি উচ্চ দক্ষতার অ্যামপ্লিফায়ার ক্লাস রয়েছে যা পাওয়ার লস কমাতে এবং দক্ষতা বাড়াতে বিভিন্ন সুইচিং কৌশল ব্যবহার করে। নীচে তালিকাভুক্ত কিছু পরিবর্ধক শ্রেণির নকশাগুলি বিদ্যুতের ক্ষতি কমাতে RLC অনুরণনকারী বা একাধিক পাওয়ার-সাপ্লাই ভোল্টেজ ব্যবহার করে, অথবা ডিজিটাল ডিএসপি (ডিজিটাল সিগন্যাল প্রসেসিং) টাইপ এমপ্লিফায়ার যা পালস প্রস্থ মড্যুলেশন (PWM) স্যুইচিং কৌশল ব্যবহার করে।


অন্যান্য সাধারণ এমপ্লিফায়ার ক্লাস

১)ক্লাস ডি অ্যামপ্লিফায়ার - একটি ক্লাস ডি অডিও অ্যামপ্লিফায়ার মূলত একটি নন-লিনিয়ার সুইচিং অ্যামপ্লিফায়ার বা PWM অ্যামপ্লিফায়ার। ক্লাস-ডি অ্যামপ্লিফায়ারগুলি তাত্ত্বিকভাবে 100% দক্ষতায় পৌঁছতে পারে, কারণ একটি চক্রের সময় ভোল্টেজ এবং কারেন্ট ওয়েভফর্ম ওভারল্যাপ ছিল না কারণ কারেন্ট শুধুমাত্র চালু থাকা ট্রানজিস্টরের মাধ্যমে আঁকা হয়।

২)ক্লাস এফ পরিবর্ধক - ক্লাস-এফ পরিবর্ধক আউটপুট তরঙ্গরূপকে একটি বর্গাকার তরঙ্গে আকৃতি দেওয়ার জন্য আউটপুট নেটওয়ার্কে হারমোনিক অনুরণনকারী ব্যবহার করে দক্ষতা এবং আউটপুট উভয়ই বৃদ্ধি করে। যদি অসীম হারমোনিক টিউনিং ব্যবহার করা হয় তবে ক্লাস-এফ পরিবর্ধকগুলি 90% এর বেশি উচ্চ দক্ষতায় সক্ষম।

৩)ক্লাস জি অ্যামপ্লিফায়ার - ক্লাস জি বেসিক ক্লাস AB অ্যামপ্লিফায়ার ডিজাইনে উন্নতির প্রস্তাব দেয়। ক্লাস জি বিভিন্ন ভোল্টেজের একাধিক পাওয়ার সাপ্লাই রেল ব্যবহার করে এবং ইনপুট সিগন্যাল পরিবর্তনের সাথে সাথে এই সরবরাহ রেলগুলির মধ্যে স্বয়ংক্রিয়ভাবে স্যুইচ করে। এই ধ্রুবক স্যুইচিং গড় বিদ্যুত খরচ হ্রাস করে, এবং সেইজন্য নষ্ট তাপের কারণে শক্তি হ্রাস পায়।

৪)ক্লাস I অ্যামপ্লিফায়ার - ক্লাস I অ্যামপ্লিফায়ারে দুটি সেট সম্পূরক আউটপুট সুইচিং ডিভাইস রয়েছে যা একই ইনপুট ওয়েভফর্মের নমুনা নেওয়া ডিভাইসগুলির উভয় সেটের সাথে একটি সমান্তরাল পুশ-পুল কনফিগারেশনে সাজানো হয়েছে। একটি ডিভাইস তরঙ্গরূপের ধনাত্মক অর্ধেক স্যুইচ করে, অন্যটি শ্রেণী বি পরিবর্ধকের মতো ঋণাত্মক অর্ধেক স্যুইচ করে। কোনো ইনপুট সিগন্যাল প্রয়োগ না করে, বা যখন কোনো সিগন্যাল শূন্য ক্রসিং পয়েন্টে পৌঁছায়, স্যুইচিং ডিভাইসগুলি একই সাথে চালু এবং বন্ধ করা হয় একটি 50% PWM ডিউটি ​​সাইকেল যে কোনো উচ্চ ফ্রিকোয়েন্সি সংকেত বাতিল করে।

৫)আউটপুট সিগন্যালের ইতিবাচক অর্ধেক তৈরি করতে, শুল্ক চক্রে ইতিবাচক স্যুইচিং ডিভাইসের আউটপুট বৃদ্ধি করা হয় যখন নেতিবাচক সুইচিং ডিভাইসটি একই এবং এর বিপরীতে হ্রাস পায়। দুটি স্যুইচিং সিগন্যাল কারেন্টকে আউটপুটে ইন্টারলিভ করা বলা হয়, ক্লাস I অ্যামপ্লিফায়ারকে এর নাম দেওয়া হয়েছে: "ইন্টারলিভড পিডব্লিউএম এমপ্লিফায়ার" 250kHz-এর বেশি ফ্রিকোয়েন্সি স্যুইচিং এ কাজ করে।

৬)ক্লাস এস অ্যামপ্লিফায়ার - একটি ক্লাস এস পাওয়ার অ্যামপ্লিফায়ার হল একটি নন-লিনিয়ার সুইচিং মোড অ্যামপ্লিফায়ার যা ক্লাস ডি এমপ্লিফায়ারের অনুরূপ। ক্লাস S পরিবর্ধক একটি ডেল্টা-সিগমা মডুলেটর দ্বারা অ্যানালগ ইনপুট সংকেতগুলিকে ডিজিটাল স্কোয়ার ওয়েভ ডালে রূপান্তরিত করে, এবং শেষ পর্যন্ত একটি ব্যান্ড পাস ফিল্টার দ্বারা ডিমডুলেট করার আগে আউটপুট শক্তি বাড়াতে তাদের প্রশস্ত করে। যেহেতু এই সুইচিং অ্যামপ্লিফায়ারের ডিজিটাল সিগন্যাল সবসময় হয় সম্পূর্ণ "চালু" বা "বন্ধ" (তাত্ত্বিকভাবে শূন্য পাওয়ার অপব্যবহার), দক্ষতা 100% পৌঁছানো সম্ভব।

৭)ক্লাস টি এমপ্লিফায়ার - ক্লাস টি এমপ্লিফায়ার হল অন্য ধরণের ডিজিটাল সুইচিং এমপ্লিফায়ার ডিজাইন। ডিজিটাল সিগন্যাল প্রসেসিং (ডিএসপি) চিপস এবং মাল্টি-চ্যানেল সার্উন্ড সাউন্ড এমপ্লিফায়ারের অস্তিত্বের কারণে ক্লাস টি এমপ্লিফায়ারগুলি আজকাল একটি অডিও এমপ্লিফায়ার ডিজাইন হিসাবে আরও জনপ্রিয় হতে শুরু করেছে কারণ এটি অ্যানালগ সংকেতগুলিকে ডিজিটাল পালস প্রস্থ মডিউলেটেড (PWM) সংকেতে রূপান্তরিত করে। পরিবর্ধক পরিবর্ধক দক্ষতা বৃদ্ধি. ক্লাস টি পরিবর্ধক ডিজাইনগুলি ক্লাস AB পরিবর্ধকের নিম্ন বিকৃতি সংকেত স্তর এবং একটি ক্লাস D পরিবর্ধকের শক্তি দক্ষতা উভয়কে একত্রিত করে।



'''),
      ],
    ),
    Racipe(
      'ট্রানজিস্টরের মডেল এবং সমতূল্য সার্কিট',
      'assets/image3.jpg',
      21,
      [
        Ingredent(01, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(02, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(03, 'hvyyvcksbnuc', 'jdfbsyudbv'),
      ],
    ),
    Racipe(
      'সিঙ্গেল স্টেজ ট্রানজিস্টর অ্যামপ্লিফায়ার',
      'assets/image41.jpg',
      21,
      [
        Ingredent(01, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(02, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(03, 'hvyyvcksbnuc', 'jdfbsyudbv'),
      ],
    ),
    Racipe(
      'ট্রানজিস্টর হাইব্রিড প্যারামিটার',
      'assets/image5.jpg',
      21,
      [
        Ingredent(01, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(02, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(03, 'hvyyvcksbnuc', 'jdfbsyudbv'),
      ],
    ),
    Racipe(
      'পাওয়ার অ্যামপ্লিফায়ার এর ধরন',
      'assets/image61.jpg',
      21,
      [
        Ingredent(01, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(02, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(03, 'hvyyvcksbnuc', 'jdfbsyudbv'),
      ],
    ),
    Racipe(
      'ফিল্ড ইফেক্ট ট্রানজিস্টর এর ধারনা',
      'assets/image7.jpg',
      21,
      [
        Ingredent(01, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(02, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(03, 'hvyyvcksbnuc', 'jdfbsyudbv'),
      ],
    ),
    Racipe(
      'মেটাল অক্সাইড সেমিকন্ডার ফেটে এর ধারনা',
      'assets/image8.jpg',
      21,
      [
        Ingredent(01, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(02, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(03, 'hvyyvcksbnuc', 'jdfbsyudbv'),
      ],
    ),
    Racipe(
      'ফিডব্যাক অ্যামপ্লিফায়ার ধারনা',
      'assets/image9.jpg',
      21,
      [
        Ingredent(01, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(02, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(03, 'hvyyvcksbnuc', 'jdfbsyudbv'),
      ],
    ),
    Racipe(
      'সাইনোসয়ডাল অসিলেটর সমূহের ধারনা',
      'assets/image10.jpg',
      21,
      [
        Ingredent(01, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(02, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(03, 'hvyyvcksbnuc', 'jdfbsyudbv'),
      ],
    ),
    Racipe(
      'মাল্টিভাইব্রেটর সার্কিট',
      'assets/image11.jpg',
      21,
      [
        Ingredent(01, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(02, 'hvyyvcksbnuc', 'jdfbsyudbv'),
        Ingredent(03, 'hvyyvcksbnuc', 'jdfbsyudbv'),
      ],
    ),
  ];
}
